#!/usr/bin/env python3
# -*- coding: utf-8 -*-

__author__ = 'ipetrash'


# TODO: добавить в бота команду конвертации ghbdtn в привет

# TODO: добавить команду Шифр Цезаря
#       https://github.com/gil9red/SimplePyScripts/blob/8c6e56d3fb2503f491b65195fd92c5b97bea7d77/caesar_code/caesar_code.py

# TODO: добавить воспроизведение речи: https://tech.yandex.ru/speechkit/cloud/
#       Этот бот-пример https://github.com/VKCOM/bot-example-php такое умеет

# TODO: добавить воспроизведение речи от переводчика bing:
#       https://github.com/gil9red/SimplePyScripts/blob/18c27c4feb4734185de0a84754ad28a2517dfb7c/speak/main.py

# TODO: команда для возврата рандомного бушизма: https://ru.wikipedia.org/wiki/%D0%91%D1%83%D1%88%D0%B8%D0%B7%D0%BC

# TODO: сделать команду поиска на википедии на подобии команды поиска через api duckduckgo

# TODO: добавить команду получения случайного комикса cynicmansion.ru
#       для получения комикса: https://github.com/gil9red/SimplePyScripts/blob/a317f43661786203047264f37b19ef45ead29f3d/get_random_comics__cynicmansion.ru/main.py
#       для постинга в сообщении картинок: https://github.com/gil9red/SimplePyScripts/blob/bf1350489cbcbfc1315a4b3e9d2d48fd15d5e6df/vk_api__examples/send_images/main.py

# TODO: команду парсинга и отображения информации из торрент-файла, который присылаешь боту. См bencode
#       Примеры: https://github.com/gil9red/SimplePyScripts/tree/8f214891b74612f013952054e997e2eec4e3b575/torrent_file

# TODO: добавить команду курс криптовалют
# TODO: добавить команду Язык Йода: http://vexer.ru/jokez/joda.php
# TODO: добавить команду для генерации в язык падонков
# TODO: добавить команду для генерации в старый православный язык
# TODO: добавить команду конвертирования, приложенной картинки в команде, в ascii графику
# TODO: поддержать опциональную команду график к командам курса валют, которая вернет картинку с графиком курса
#       диапазон курса выбрать опытным путем
# TODO: добавить команду поиска на торрентах, которая вернет ссылку на .torrent файл

# TODO: добавить команду для возврата гифки из https://giphy.com/ (https://developers.giphy.com/)
#       аналог такого делает бот битрикса. Команды поиска похоже нужно будет переводить на английский
#       для постинга в сообщении: https://github.com/gil9red/SimplePyScripts/blob/69cfb76ebdde46be5975dd1b4119d159496b79eb/vk_api__examples/send_document__gif/main.py

# TODO: добавить команду южный парк, которая по указанному сезону и серии возвращает видео, например:
#       Бот, южный парк S10E9 (т.е. сезон 10 эпизод 9)

# TODO: добавить команду комплимент, типа: Бот, комплимент маме. Бот, комплимент девушке. Бот, комплимент парню.

# TODO: команда превращения ссылки в короткую (пусть будет выбор через какой сервис сокращать ссылку)
# TODO: команду генерации qrcode, который или ссылкой возвращается или как картинка
# TODO: команду возврата поздравления к др/юбилею для папы/мамы/бабушки и т.п.
# TODO: команду добавления напоминаний, типа "Бот, напомни о встрече у Ленина в 12:30"
# TODO: команду угадывания что на картинке
# TODO: команду ретуши фотографии -- например faceapp умеет добавлять улыбку и т.п.
# TODO: 'что посмотреть': 'Рандомная ссылка на кинопоиск'
# TODO: 'котики': ':3',
